app/Controllers/UserController.php

    public function login()
    {
        $user = new UserModel();
        $username = $this->request->getPost('username');
        $pw = $this->request->getPost('password');
        $dataUser = $user->where(['username' => $username])->orWhere(['email' => $username])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin@mail.com'
OR `email` = 'admin@mail.com'
 LIMIT 1